{
    "profile_name": "Ravi",
    "profile_description_1": "Passionate about technology and software quality, I graduated in Systems Analysis and Development from <strong>University of Fortaleza (UNIFOR)</strong> and have postgraduate degrees in <strong>Software Engineering with Emphasis on Quality</strong> and <strong>Frontend Development</strong>.",
    "profile_description_2": "I work as a Software Quality Analyst, with experience in automated testing using <strong>Cypress, Selenium WebDriver</strong>, and others. I am familiar with <strong>Angular, React, Git, SQL</strong>, and agile methodologies.",
    "profile_description_3": "I study <strong>English with native teachers</strong> five times a week, aiming to improve my skills in the language. I am <strong>detail-oriented, organized, and committed</strong> to excellence.",
    "profile_quote": "“I am impressed by the positive impact technology can have on people's lives by solving real, everyday problems. The ability for innovation and transformation that it provides inspires me more and more to continue deepening my knowledge, driven by a fascination for the endless possibilities that technology offers.”",
    "see_resume_pt": "View Resume in Portuguese",
    "see_resume_en": "View Resume in English",
    "contact": "Contact",
    "contact_intro": "If you'd like to get in touch with me, below are some ways you can contact me.",
    "contact_email": "ravifel.contact@gmail.com",
    "contact_whatsapp": "WhatsApp",
    "contact_linkedin": "LinkedIn",
    "contact_github": "GitHub",
    "technologies": "Technologies",
    "welcome": "Welcome to my portfolio!",
    "repositories": "Repositories",
    "dark_mode": "Dark Mode",
    "light_mode": "Light Mode",
    "language": "Language",
    "home": "Home",
    "view_repository": "View repository",
    "testimonials": "Testimonials",
    "select_language": "Select language",
    "testimonials_section": {
        "title": "Testimonials",
        "sort_label": "Sort by:",
        "most_recent": "Most recent",
        "oldest": "Oldest",
        "see_more": "See more",
        "see_more_aria": "See more of the testimonial",
        "close_modal": "Close modal",
        "description": "Recommendations made via LinkedIn. To see the recommendations on my LinkedIn profile, click the button below."
    },
    "testimonials_data": [
        {
            "name": "Luana Medeiros",
            "title": "Frontend Developer",
            "connection": "We worked at the same company, but on different teams.",
            "recommendation": {
                "pt": "É um prazer recomendar o Ravi, trabalhamos juntos por um período na equipe de produto da Polibras. Durante esse tempo, pude ver o quanto ele é dedicado, sempre muito focado e organizado. Você faz muita diferença e foi uma ótima experiência trabalhar juntos!",
                "en": "It is a pleasure to recommend Ravi; we worked together for a period on the Polibras product team. During this time, I saw how dedicated a professional he is, always very focused and organized. You make a big difference, and it was a great experience working together!"
            },
            "date": "2024-03-29"
        },
        {
            "name": "Diego Silva Costa",
            "title": "QA Analyst",
            "connection": "We worked on the same team.",
            "recommendation": {
                "pt": "Durante a oportunidade que tive de trabalhar com o Ravi, aprendi muito sobre os procedimentos internos da empresa. Um profissional atualizado, paciente, dedicado e, acima de tudo, proativo na resolução de problemas. Seu conhecimento sempre agregou muito e, hoje, parte do profissional que sou devo a ele.",
                "en": "During the opportunity I had to work with Ravi, I learned a lot about the company's internal procedures. An up-to-date, patient, dedicated professional and, above all, proactive in solving problems. His knowledge has always added a lot, and today, part of the professional I am thanks to him."
            },
            "date": "2024-03-28"
        },
        {
            "name": "Thalia Lopes",
            "title": "Career Guidance | Talent Acquisition | Tech Recruiter | Onboarding | Psychological Assessment",
            "connection": "We worked at the same company, but on different teams.",
            "recommendation": {
                "pt": "Ravi foi um talento que me chamou atenção desde a sua seleção. Pude acompanhá-lo de perto durante toda a sua entrada e permanência no estágio até o momento da sua efetivação. Sua dedicação e compromisso foi, com certeza, um dos pontos mais marcantes na sua trajetória, até agora. É inspirador trabalhar com pessoas assim! Parabéns Ravi!",
                "en": "Ravi was a talent who caught my attention from the selection process. I was able to closely follow him throughout his internship until his permanent position. His dedication and commitment were certainly some of the most remarkable points in his journey so far. It is inspiring to work with people like that! Congratulations, Ravi!"
            },
            "date": "2023-08-07"
        },
        {
            "name": "Rony de Freitas",
            "title": "UX Designer",
            "connection": "We worked at the same company, but on different teams.",
            "recommendation": {
                "pt": "Trabalhar com o Ravi foi incrível. Ele é dedicado e atencioso, sempre buscando melhorar. Tive o prazer de trabalhar com ele na equipe de QA da nossa empresa. Ravi demonstrou grande habilidade em testes de regressão e automação. Sua atenção aos detalhes e capacidade de encontrar bugs foram impressionantes. Recomendo o Ravi como um profissional talentoso e comprometido.",
                "en": "Working with Ravi was incredible. He is dedicated and attentive, always striving to improve. I had the pleasure of working with him on the QA team of our company. Ravi demonstrated great skill in regression and automation testing. His attention to detail and ability to find bugs were impressive. I recommend Ravi as a talented and committed professional."
            },
            "date": "2024-07-09"
        },
        {
            "name": "Gabriel Bastos",
            "title": "Head IT and .NetCore | C# | SQL | Azure | Xamarin | Angular | Java Developer",
            "connection": "Gabriel directly supervised Ravi.",
            "recommendation": {
                "pt": "Hoje quero compartilhar um pouco sobre um profissional que não foi apenas parte da nossa equipe, mas também se tornou um grande amigo. Receber o Ravi em meu time foi uma daquelas experiências que nos faz perceber como o ambiente de trabalho pode se tornar um lugar realmente especial. Desde o primeiro dia, ele demonstrou clareza de ideias e responsabilidade que me impressionaram muito. Seu compromisso com a entrega de resultados excepcionais não só foi atendido, mas superou todas as expectativas. Um aspecto que sempre admirei foi sua capacidade de aprender muito rápido e, além disso, aplicar o que aprendeu. Dessa forma, ele foi peça fundamental no desenvolvimento do sistema Angular. Ele não apenas dominou a tecnologia, mas também tinha uma maneira única de tornar as coisas claras e acessíveis para toda a equipe. Além da parte técnica, um fator muito importante é sua habilidade de trabalhar em equipe. Ele nunca perdeu o foco no objetivo maior, sempre mantendo uma atitude colaborativa e encorajadora. Obrigado por todo seu suporte técnico no projeto, assim como seu apoio no desenvolvimento do time. Parabéns por ser um profissional tão transparente, honesto e que entrega resultados.",
                "en": "Today I want to share a bit about a professional who was not only part of our team but also became a great friend. Welcoming Ravi to my team was one of those experiences that makes us realize how the work environment can become a truly special place. From the first day, he demonstrated clarity of ideas and responsibility that greatly impressed me. His commitment to delivering exceptional results was not only met but exceeded all expectations. One aspect I always admired was his ability to learn very quickly and, moreover, to apply what he learned. In this way, he was a key part in the development of the Angular system. He not only mastered the technology but also had a unique way of making things clear and accessible to the entire team. In addition to the technical part, a very important factor is his ability to work as a team. He never lost focus on the bigger goal, always maintaining a collaborative and encouraging attitude. Thank you for all your technical support on the project, as well as your support for team development. Congratulations on being such a transparent, honest professional who delivers results."
            },
            "date": "2024-04-24"
        },
        {
            "name": "Ronaldo Dantas",
            "title": "Development Manager and Technical Lead at Polibras Software",
            "connection": "Ronaldo directly supervised Ravi.",
            "recommendation": {
                "pt": "Participei do início de carreira do Ravi de estagiário de testes até Analista de Qualidade e posso concluir que o Ravi é um profissional de disciplina e empenho ímpar. Você pode contar com o Ravi para garantir que o trabalho que precisa ser feito será realizado da maneira conforme planejada, sem margem a falha. Altamente disciplinado e esforçado. Consegue ser flexível em vários produtos distintos mantendo o foco no resultado alvo. É um excelente parceiro e agrega com qualidade qualquer equipe que participar.",
                "en": "I participated in the beginning of Ravi's career from testing intern to Quality Analyst and I can conclude that Ravi is a professional with unique discipline and commitment. You can count on Ravi to ensure that the work that needs to be done will be carried out as planned, with no margin for error. Highly disciplined and hardworking. He can be flexible in various different products while maintaining focus on the target outcome. He is an excellent partner and adds quality to any team he joins."
            },
            "date": "2024-07-14"
        },
        {
            "name": "Jaelyson Martins",
            "title": "Senior Software Developer | Polibras Software",
            "connection": "We worked on the same team.",
            "recommendation": {
                "pt": "Ravi é um ótimo profissional, altamente flexível e sempre disposto a aprender novos assuntos. Ele exerce sua função com competência e consistência, além de ser altamente comunicativo, o que facilita a colaboração dentro da equipe. Nesse um ano de participação, ele se mostrou altamente participativo, mantendo uma ótima relação com o time de desenvolvimento e demonstrando um verdadeiro interesse em entender o negócio e o produto. Certamente será um ativo valioso para qualquer organização.",
                "en": "Ravi is an excellent professional, highly flexible and always willing to learn new subjects. He performs his duties with competence and consistency, and is highly communicative, which facilitates collaboration within the team. Over the past year, he has shown great involvement, maintaining an excellent relationship with the development team and demonstrating a genuine interest in understanding the business and the product. He will certainly be a valuable asset to any organization."
            },
            "date": "2024-07-09"
        },
        {
            "name": "Davi Fernandes",
            "title": "Quality Analyst | C#, .NET, JavaScript, Python | Playwright, Selenium, SQL, Azure DevOps, GitHub Copilot",
            "connection": "We worked on the same team.",
            "recommendation": {
                "pt": "Tive a oportunidade de trabalhar com o Ravi e, com certeza, posso dizer que ele é um analista de qualidade excepcional. Seu domínio em criar casos de testes e criar cenários em cima de aplicações backend e frontend é impressionante. Ele sempre assegura testes de alta qualidade e faz uma grande diferença na estabilidade e desempenho dos sistemas em que está envolvido. Mas o que realmente torna o Ravi especial é sua atitude. Ele é uma pessoa incrível, sempre disposto a ajudar e a compartilhar seu conhecimento com os demais. Sua bondade e empatia criam um ambiente de trabalho colaborativo e positivo, onde todos se sentem apoiados. Se você está em busca de um analista de qualidade altamente qualificado, que é meticuloso e dedicado aos detalhes, além de ser uma excelente pessoa, eu recomendo o Ravi sem hesitação!",
                "en": "I had the opportunity to work with Ravi and I can certainly say that he is an exceptional quality analyst. His expertise in creating test cases and scenarios on backend and frontend applications is impressive. He always ensures high-quality tests and makes a big difference in the stability and performance of the systems he is involved with. But what really makes Ravi special is his attitude. He is an amazing person, always willing to help and share his knowledge with others. His kindness and empathy create a collaborative and positive work environment where everyone feels supported. If you are looking for a highly skilled quality analyst who is meticulous and detail-oriented, as well as an excellent person, I recommend Ravi without hesitation!"
            },
            "date": "2025-03-27"
        },
        {
            "name": "Marcos Venicio Viana",
            "title": "Software Testing and Quality Analyst (QA)",
            "connection": "Marcos Venicio directly supervised Ravi.",
            "recommendation": {
                "pt": "Tive o prazer de trabalhar ao lado do Ravi por dois anos e testemunhar de perto suas qualidades excepcionais. Ele é um profissional extremamente esforçado, dedicado e pontual. Ravi se destaca por sua capacidade de observação e sua ética impecável. Além disso, ele é uma pessoa extremamente educada, o que torna o ambiente de trabalho muito mais agradável. Durante o tempo em que trabalhamos juntos, Ravi demonstrou um desejo constante de aprimoramento, especialmente nas áreas de Quality Assurance e no aprendizado do inglês. Ele está sempre buscando novas formas de melhorar seus resultados e contribuir para a equipe. Recomendo Ravi sem hesitação para qualquer oportunidade futura, pois sei que se trata de um profissional de alto nível.",
                "en": "I had the pleasure of working alongside Ravi for two years and witnessing his exceptional qualities up close. He is an extremely hardworking, dedicated, and punctual professional. Ravi stands out for his observation skills and impeccable ethics. In addition, he is an extremely polite person, which makes the work environment much more pleasant. During the time we worked together, Ravi showed a constant desire for improvement, especially in the areas of Quality Assurance and learning English. He is always looking for new ways to improve his results and contribute to the team. I recommend Ravi without hesitation for any future opportunity, as I know he is a top-level professional."
            },
            "date": "2024-07-20"
        },
        {
            "name": "Júnior Veras",
            "title": "QA & Test Automation Analyst | C# | Selenium | Playwright",
            "connection": "We worked on the same team.",
            "recommendation": {
                "pt": "Tive o prazer de trabalhar com Ravi na equipe e posso dizer com certeza que ele é um profissional excepcional. Sempre comprometido com a excelência das entregas, Ravi demonstra grande dedicação e atenção aos detalhes, garantindo que os processos sejam executados com qualidade e eficiência. Além do seu conhecimento técnico sólido, ele se destaca pela colaboração e espírito de equipe, estando sempre disposto a ajudar e compartilhar conhecimento. Seus conhecimentos em automação de testes, bancos de dados e validação de APIs com Postman fazem dele um profissional versátil e altamente capacitado. Além disso, sua organização e comprometimento contribuem para um ambiente de trabalho produtivo e harmonioso. Sem dúvidas, Ravi é um grande talento, e qualquer equipe que contar com ele terá um profissional dedicado e competente. Recomendo fortemente!",
                "en": "I had the pleasure of working with Ravi on the team and I can say with certainty that he is an exceptional professional. Always committed to delivering excellence, Ravi demonstrates great dedication and attention to detail, ensuring that processes are executed with quality and efficiency. In addition to his solid technical knowledge, he stands out for his collaboration and team spirit, always willing to help and share knowledge. His knowledge of test automation, databases, and API validation with Postman makes him a versatile and highly qualified professional. In addition, his organization and commitment contribute to a productive and harmonious work environment. Without a doubt, Ravi is a great talent, and any team that counts on him will have a dedicated and competent professional. I highly recommend him!"
            },
            "date": "2025-04-01"
        },
        {
            "name": "Augusto Soares",
            "title": "Software Engineer | Java | Groovy | Go | Python",
            "connection": "We worked on the same team.",
            "recommendation": {
                "pt": "Tive o privilégio de trabalhar com o Ravi na Fitbank, onde ele atuou como Analista de Qualidade (QA) com excelência. Desde o início, Ravi demonstrou um domínio técnico notável, especialmente na criação de testes automatizados eficientes, que ajudaram a garantir entregas mais seguras e ágeis para o time de desenvolvimento. Um dos diferenciais mais marcantes do Ravi é sua habilidade de analisar escopos e códigos com um olhar crítico e construtivo. Ele identifica pontos que impactam diretamente na segurança e no desempenho das aplicações, colaborando ativamente com os desenvolvedores para melhorar a qualidade do software como um todo. Suas sugestões sempre vêm acompanhadas de argumentos sólidos, baseados em boas práticas e experiências reais. Além disso, Ravi se destaca pelo seu domínio da língua inglesa. Em diversas ocasiões, ele foi peça-chave para que colegas entendessem melhor tanto documentações técnicas quanto partes do código escritas em inglês, contribuindo diretamente para a fluidez do trabalho em equipe e a autonomia dos profissionais ao lidar com conteúdos internacionais. Profissional comprometido, colaborativo e tecnicamente muito bem preparado, Ravi é uma adição valiosa a qualquer equipe de tecnologia.",
                "en": "I had the privilege of working with Ravi at Fitbank, where he excelled in his role as a QA Analyst. From the beginning, Ravi demonstrated remarkable technical expertise, especially in creating efficient automated tests that helped ensure safer and faster deliveries for the development team. One of Ravi's most outstanding qualities is his ability to analyze scopes and code with a critical and constructive eye. He identifies aspects that directly impact the security and performance of applications, actively collaborating with developers to improve the overall quality of the software. His suggestions are always accompanied by solid arguments, based on best practices and real-world experience. Moreover, Ravi stands out for his command of the English language. On several occasions, he was a key player in helping colleagues better understand both technical documentation and parts of code written in English, directly contributing to teamwork fluidity and the autonomy of professionals when dealing with international content. A committed, collaborative, and technically well-prepared professional, Ravi is a valuable addition to any technology team."
            },
            "date": "2025-05-06"
        },
        {
            "name": "Pedro Henrique Ferreira",
            "title": "QA Lead - Junior III at FitBank | Quality Assurance and AutomationQA Lead - Junior III at FitBank | Quality Assurance and Automation",
            "connection": "Pedro supervised Ravi directly",
            "recommendation": {
                "pt": "Tive o privilégio de trabalhar com Ravi Felipe na área de Qualidade, e posso afirmar que sua dedicação, competência e atenção aos detalhes são admiráveis. Durante o tempo em que atuamos juntos, ele demonstrou proatividade na resolução de problemas, habilidade técnica sólida e um olhar analítico que contribuiu diretamente para a melhoria contínua dos processos. Além de sua competência técnica, Ravi é colaborativo, comprometido com resultados e sempre disposto a ajudar o time a alcançar seus objetivos. Sem dúvida, é um profissional que agrega valor a qualquer equipe.",
                "en": "I had the privilege of working with Ravi Felipe in the Quality area, and I can confidently say that his dedication, expertise, and attention to detail are remarkable. During our time working together, he demonstrated proactivity in problem-solving, strong technical skills, and an analytical mindset that directly contributed to the continuous improvement of processes. Beyond his technical expertise, Ravi is collaborative, results-driven, and always willing to support the team in achieving its goals. Without a doubt, he is a professional who brings great value to any team."
            },
            "date": "2025-08-08"
        },
        {
            "name": "Robson Medeiros",
            "title": "Fullstack Developer | React, Node.js, PostgreSQL, DockerFullstack Developer | React, Node.js, PostgreSQL, Docker",
            "connection": "Robson worked with Ravi but on different teams",
            "recommendation": {
                "pt": "Existem profissionais que demonstram seu imenso potencial desde o primeiro contato, e Ravi é, sem dúvida, um deles. Tive o prazer de conhecê-lo durante seu processo de onboarding no FitBank e imediatamente percebi que estava lidando com alguém único. Seu esforço e proatividade eram notáveis; ele não se limitava ao essencial, mas fazia perguntas estratégicas que demonstravam uma clara ambição de crescer e agregar valor. Essa impressão inicial foi rapidamente confirmada. Ao assumir suas responsabilidades como QA, Ravi se destacou pela alta qualidade técnica, desenvolvendo casos de teste detalhados, executando testes manuais com precisão e avançando na automação para garantir a qualidade de produtos financeiros complexos. Ele esteve presente nos grandes projetos da empresa, não como um mero participante, mas como um ator-chave cujo esforço e excelência sempre resultaram em excelentes entregas. Além de sua competência técnica, tive a sorte de conhecer Ravi em um nível mais pessoal. Descobri um colega extremamente prestativo, sempre disposto a ajudar, ensinar e explicar pacientemente as regras de negócio dos produtos. Ele foi fundamental na minha jornada, ajudando-me a entender na prática o que significa conduzir testes em um nível verdadeiramente profissional. O Ravi é o tipo de profissional que não só eleva a qualidade do trabalho, como também enriquece a equipe ao seu redor, criando um ambiente de trabalho dinâmico e agradável. Qualquer empresa ou projeto se beneficiaria enormemente de tê-lo conosco.",
                "en": "There are professionals who demonstrate their immense potential from the very first contact, and Ravi is undoubtedly one of them. I had the pleasure of meeting him while conducting his onboarding process at FitBank, and I immediately realized I was dealing with someone unique. His effort and proactivity were remarkable; he didn't limit himself to the essentials, but asked strategic questions that demonstrated a clear ambition to grow and add value. This initial impression was quickly confirmed. Upon assuming his responsibilities as QA, Ravi distinguished himself with high technical quality, developing detailed test cases, executing manual tests with precision, and advancing automation to ensure the quality of complex financial products. He was present in the company's massive projects, not as a mere participant, but as a key player whose effort and excellence always resulted in great deliverables. Beyond his technical competence, I was fortunate to get to know Ravi on a more personal level. I discovered an extremely helpful colleague, always willing to help, teach, and patiently explain the business rules of the products. He was instrumental in my own journey, helping me understand in practice what it means to conduct tests at a truly professional level. Ravi is the kind of professional who not only elevates the quality of work but also enriches the team around him, creating a dynamic and enjoyable work environment. Any company or project would benefit enormously from having him on board."
            },
            "date": "2025-08-08"
        },
        {
            "name": "Delano Marques",
            "title": "Human Resources Analyst/HeadhunterHuman Resources Analyst/Headhunter",
            "connection": "Delano worked with Ravi on the same team",
            "recommendation": {
                "pt": "Tive o prazer de trabalhar com o Ravi e posso afirmar com segurança que ele é um excelente profissional. Sua dedicação e comprometimento em entregar resultados de alta qualidade realmente se destacam. O Ravi é confiável, trabalhador e sempre traz uma atitude positiva para a equipe. Recomendo-o fortemente para futuras oportunidades.",
                "en": "I had the pleasure of working with Ravi, and I can confidently say that they are an excellent professional. Their dedication and commitment to delivering high-quality results truly stand out. Ravi is reliable, hardworking, and always brings a positive attitude to the team. I strongly recommend them for any future opportunities."
            },
            "date": "2025-08-17"
        },
        {
            "name": "Witalo Vieira Melo",
            "title": "DevOps Engineer | Azure DevOps",
            "connection": "Witalo trabalhava com Ravi na mesma equipe",
            "recommendation": {
                "pt": "Tive a oportunidade de trabalhar com o Ravi e rapidamente ficou claro o quão comprometido e dedicado ele é como profissional. Como testador, ele está sempre ansioso para aprender coisas novas, estudando e se aprimorando constantemente para entregar os melhores resultados. Além de suas habilidades técnicas, o que mais se destaca é sua atitude solidária e a energia positiva que inspira todos ao seu redor. Sua capacidade de construir amizades facilmente e promover a colaboração torna o trabalho em equipe muito mais tranquilo e agradável. Sem dúvida, o Ravi é um excelente profissional e uma ótima pessoa para se ter na equipe.",
                "en": "I had the opportunity to work with Ravi, and it quickly became clear how committed and dedicated he is as a professional. As a tester, he is always eager to learn new things, constantly studying and improving to deliver the best results. Beyond his technical skills, what stands out the most is his supportive attitude and the positive energy that inspires everyone around him. His ability to build friendships easily and foster collaboration makes teamwork much smoother and more enjoyable. Without a doubt, Ravi is both an excellent professional and a great person to have on the team."
            },
            "date": "2025-08-17"
        }
    ],
    "techs": {
        "playwright": "Playwright",
        "selenium": "Selenium WebDriver",
        "csharp": "C#",
        "cypress": "Cypress",
        "javascript": "JavaScript",
        "typescript": "TypeScript",
        "postman": "Postman",
        "sql": "SQL",
        "postgresql": "PostgreSQL",
        "sqlite": "SQLite",
        "git": "Git",
        "github": "GitHub",
        "bitbucket": "BitBucket",
        "react": "React JS",
        "angular": "Angular",
        "html": "HTML",
        "css": "CSS",
        "bootstrap": "Bootstrap",
        "angularmaterial": "Angular Material",
        "vscode": "Visual Studio Code",
        "jira": "Jira",
        "teams": "Teams",
        "azuredevops": "Azure DevOps",
        "trello": "Trello",
        "windows": "Windows",
        "linux": "Linux",
        "fedora": "Fedora",
        "ubuntu": "Ubuntu"
    },
    "pagination": {
        "items_per_page": "Results per page",
        "of": "of",
        "prev_page": "Previous page",
        "next_page": "Next page"
    },
    "notfound": {
        "title": "Page not found",
        "message": "Sorry, the page you are looking for does not exist.",
        "backHome": "Back to Home"
    },
    "contactForm": {
        "contact_form_title": "Contact Me",
        "name": "Name",
        "email": "Email",
        "message": "Message",
        "send": "Send",
        "success": "Message sent successfully!",
        "error": "There was an error sending your message. Please try again."
    },
    "repositories_test_group": "Test Repositories",
    "repositories_dev_group": "Development Repositories",
    "repo_landing_page_tests_automated_name": "Landing Page Tests Automated",
    "repo_landing_page_tests_automated_desc": "Automated tests for Agilean's LandingPage.",
    "repo_selenium_ui_test_csharp_name": "Selenium UI Test Csharp",
    "repo_selenium_ui_test_csharp_desc": "Selenium WebDriver | C#.Net | Workshop | (RKTestingTools)",
    "repo_cypress_test_api_name": "Cypress Test Api",
    "repo_cypress_test_api_desc": "Cypress project for API testing.",
    "repo_cypress_project_to_practice_name": "Cypress Project To Practice",
    "repo_cypress_project_to_practice_desc": "Web automation with Cypress.",
    "repo_cypress_bdd_cucumber_name": "Cypress BDD Cucumber",
    "repo_cypress_bdd_cucumber_desc": "Web automation with Cypress and Cucumber (BDD).",
    "repo_cypress_web_automation_tests_name": "Cypress Web Automation Tests",
    "repo_cypress_web_automation_tests_desc": "Web automation with Cypress.",
    "repo_website_ravi_portfolio_react_name": "Website Ravi Portfolio React",
    "repo_website_ravi_portfolio_react_desc": "Personal portfolio website using React.",
    "repo_book_library_project_name": "Book Library Project",
    "repo_book_library_project_desc": "The system simulates a virtual book library. Front-end study project.",
    "repo_projeto_angular_spa_name": "Angular Spa Project",
    "repo_projeto_angular_spa_desc": "Project developed in the course \"SPA Development with Angular\", on the Desenvolvedor.io platform.",
    "repo_curso_angular9_cod3r_name": "Angular9 COD3R Course",
    "repo_curso_angular9_cod3r_desc": "Project developed during the \"Angular 9 Essential\" course, from the Cod3r platform.",
    "repo_email_js_angular_name": "Email JS Angular",
    "repo_email_js_angular_desc": "Email sending service using \"EmailJS\" implemented in Angular with TypeScript.",
    "repo_movies_project_name": "Movies Project",
    "repo_movies_project_desc": "In this project, the user can search for movies and view information about them."
}